starter-kit-parens.org
** COMMENT Bindings

Daniel Guinea Martín disables this on Fri Oct 18 13:25:06 2019, as I have previously disabled smartparens.

#+BEGIN_SRC emacs-lisp :tangle no
(defmacro def-pairs (pairs)
  "Define functions for pairing. PAIRS is an alist of (NAME . STRING)
conses, where NAME is the function name that will be created and
STRING is a single-character string that marks the opening character.

  (def-pairs ((paren . \"(\")
              (bracket . \"[\"))

defines the functions WRAP-WITH-PAREN and WRAP-WITH-BRACKET,
respectively."
  `(progn
     ,@(loop for (key . val) in pairs
             collect
             `(defun ,(read (concat
                             "wrap-with-"
                             (prin1-to-string key)
                             "s"))
                  (&optional arg)
                (interactive "p")
                (sp-wrap-with-pair ,val)))))

(def-pairs ((paren . "(")
            (bracket . "[")
            (brace . "{")
            (single-quote . "'")
            (double-quote . "\"")
            (back-quote . "`")))

(bind-keys
 :map smartparens-mode-map
 ("C-M-a" . sp-beginning-of-sexp)
 ("C-M-e" . sp-end-of-sexp)

 ("C-<down>" . sp-down-sexp)
 ("C-<up>"   . sp-up-sexp)
 ("M-<down>" . sp-backward-down-sexp)
 ("M-<up>"   . sp-backward-up-sexp)

 ("C-M-f" . sp-forward-sexp)
 ("C-M-b" . sp-backward-sexp)

 ("C-M-n" . sp-next-sexp)
 ("C-M-p" . sp-previous-sexp)

 ("C-S-f" . sp-forward-symbol)
 ("C-S-b" . sp-backward-symbol)

 ("C-<right>" . sp-forward-slurp-sexp)
 ("M-<right>" . sp-forward-barf-sexp)
 ("C-<left>"  . sp-backward-slurp-sexp)
 ("M-<left>"  . sp-backward-barf-sexp)

 ("C-M-t" . sp-transpose-sexp)
 ("C-M-k" . sp-kill-sexp)
 ("C-k"   . sp-kill-hybrid-sexp)
 ("M-k"   . sp-backward-kill-sexp)
 ("C-M-w" . sp-copy-sexp)
 ("C-M-d" . delete-sexp)

 ("M-<backspace>" . backward-kill-word)
 ("C-<backspace>" . sp-backward-kill-word)
 ([remap sp-backward-kill-word] . backward-kill-word)

 ("M-[" . sp-backward-unwrap-sexp)p
 ("M-]" . sp-unwrap-sexp)

 ("C-x C-t" . sp-transpose-hybrid-sexp)

 ("C-c ("  . wrap-with-parens)
 ("C-c ["  . wrap-with-brackets)
 ("C-c {"  . wrap-with-braces)
 ;; ("C-c '"  . wrap-with-single-quotes)  ;; messes around with this binding needed by =org-edit-src-exit=
 ("C-c \"" . wrap-with-double-quotes)
 ("C-c _"  . wrap-with-underscores)
 ("C-c `"  . wrap-with-back-quotes))
#+END_SRC

#+RESULTS:
: wrap-with-back-quotes

** Learning Smartparens: Map 
*** Starts and ends
- =C-M-a=: =sp-beginning-of-sexp=.
- =C-M-e=: =sp-end-of-sexp=.

*** Traversing lists

- =C-down=: =sp-down-sexp=

From 
#+BEGIN_EXAMPLE
(defun format-date (format)
  "Insert date with FORMAT specification using a specific locale."
  (let ((system-time-locale "en_US.UTF-8"))^
    (insert (format-time-string format)))) 
#+END_EXAMPLE

To
#+BEGIN_EXAMPLE
(defun format-date (format)
  "Insert date with FORMAT specification using a specific locale."
  (let ((system-time-locale "en_US.UTF-8"))
    (^insert (format-time-string format))))
#+END_EXAMPLE

- =C-up=: =sp-up-sexp=: from =(str ^"foo" "bar baz qux")= to =(str "foo" "bar baz qux")^=
- =M-down=: =sp-backward-down-sexp=: from =(defn foo [bar] ^(let [x 0] x))= to =(defn foo [bar^] (let [x 0] x))=
- =M-up=: =sp-backward-up-sexp=: from =(insert (format-time-string^ format))= to =(insert ^(format-time-string format))=

*** Block movements
- =C-M-f=: =sp-forward-sexp=: from =(:require ^[clojure.string :as s])= to =(:require [clojure.string :as s]^)=
- =C-M-b=: =sp-forward-sexp=: from =(:require [clojure.string :as s]^)= to =(:require ^[clojure.string :as s])=

*** Top-level-ish traversal
- =C-M-n=: =sp-next-sexp=

From
#+BEGIN_EXAMPLE
(defn blah
  "Returns blah of foo."^
  [foo]                 
  )
#+END_EXAMPLE

To
#+BEGIN_EXAMPLE
(defn blah
  "Returns blah of foo."
  ^[foo]                 
  )
#+END_EXAMPLE

- =C-M-p=: =sp-previous-sexp=

*** Free-form movements
They navigate around expressions as if delimiters, like parens, brackets, and braces do not exist.

- =C-S-b=: =sp-backward-symbol=: from =(defn blah [] (^let [x 0 y 1] (+ x 1)))= to =(defn ^blah [] (let [x 0 y 1] (+ x 1)))=
- =C-S-f=: =sp-forward-symbol=: from =(defn blah [^] (let [x 0 y 1] (+ x 1)))= to =(defn blah [] (let^ [x 0 y 1] (+ x 1)))=

*** Wrapping

- =C-M-Space= selects region and then =[= surrounds whole region with matching [ and ]
- It also applies to keys like (, {, ", ', *, _, etc, depending on the mode that you’re using.
- =C-c (=
- =C-c [=
- =C-c {=

**** In Org-mode
- =s-~=  
- ="s-="=

*** Unwrapping
- =M-[=: =sp-backward-unwrap-sexp=: from =(foo ^(bar x y z))= to =foo ^(bar x y z)=
- =M-]=: =sp-unwrap-sexp=: from =(foo ^(bar x y z))= to =(foo bar x y z)=

*** Slurp and barf
- =C-right=: =sp-forward-slurp-sexp=: from =[foo bar^] baz= to =[foo bar ^baz]=. NB: critical that ^ be inside ] for this to work.
  + Conversly, =M-right=: =sp-forward-barf-sexp=: from =[foo bar ^baz]= to =[foo bar^] baz= 
- =C-left=: =sp-backward-slurp-sexp=: from =blah [foo bar^]= to =[blah foo bar^]=
  + =M-left=: =sp-backward-barf-sexp= from =[blah foo bar^]= to =blah [foo bar^]= 

*** Swapping
- =C-M-t=: =sp-transpose-sexp=: from ="foo" ^"bar"= to ="bar" ^"foo"=

*** Killing
- =C-M-k=: =sp-kill-sexp=: from =(let [x "xxx" y ^"y yy yyy" z 0])= to =(let [x "xxx" y ^ z 0])=
- =C-k=: =sp-kill-hybrid-sexp=: from =(let [x "xxx" y ^"y yy yyy" z 0])= to ==(let [x "xxx" y])= 
- =M-k=: =sp-backward-kill-sexp=: from =(:require [clojure.string :as s]^)= to =(:require ^)=


** COMMENT Smartparens for different minor modes

Daniel Guinea Martín disables this on Fri Oct 18 13:25:06 2019, as I have previously disabled smartparens.

#+BEGIN_SRC emacs-lisp :tangle no
 ;; (require 'smartparens-text)
 ;; (require 'smartparens-org)
 (require 'smartparens-ess)
 ;; (require 'smartparens-markdown)
 (require 'smartparens-racket)
 ;; (require 'smartparens-latex)
 #+END_SRC

#+RESULTS:
: smartparens-text

#+BEGIN_SRC emacs-lisp :tangle no :results silent
(sp-with-modes 'org-mode
  (sp-local-pair "~" "~" :bind "s-~")
  (sp-local-pair "=" "=" :bind "s-="))

;;(sp-local-pair 'org-mode-hook "=" "=")
;;(sp-local-pair 'org-mode-hook "\[" "\]")
  ;; org-mode. This is not working though...
  ;;    (sp-local-pair 'org-mode "~" "~")
  ;; (sp-local-pair 'org-mode-hook "=" "=") ; =select= region, hit = then region -> =region= in org-mode
  ;;    (sp-local-pair 'org-mode "*" "*") ; select region, hit * then region -> *region* in org-mode
  ;;    (sp-local-pair 'org-mode "/" "/") ; select region, hit / then region -> /region/ in org-mode
  ;;    (sp-local-pair 'org-mode "_" "_") ; select region, hit _ then region -> _region_ in org-mode
  ;;    (sp-local-pair 'org-mode "+" "+") ; select region, hit + then region -> +region+ in org-mode
  ;;    (sp-local-pair 'org-mode "$" "$") ; 
  ;;    ;; (sp-local-pair 'org-mode "`" "'") ; not working, as it waits for second `
  ;;   (sp-local-pair 'org-mode "``" "''") 
#+END_SRC

* Electric pair mode
From http://ergoemacs.org/emacs/emacs_insert_brackets_by_pair.html

Emacs 24 has a new minor mode electric-pair-mode. When on, typing any left bracket automatically insert the right matching bracket. You can have it on always. Put this in your emacs init:

#+BEGIN_SRC emacs-lisp :tangle yes
;; auto close bracket insertion. New in emacs 24
(electric-pair-mode 1)
#+END_SRC

Brackets includes ASCII and Unicode brackets or quotation marks. Deleting one bracket doesn't delete the other. Exactly which brackets are auto-closed depends on the current major mode's syntax table. If you always want certain brackets be inserted in pairs, you can customize the variable electric-pair-pairs. Its value should be a Association List. For example, the curly bracket ={}= isn't auto-closed when in emacs-lisp-mode. You can make it do so, like this:

#+BEGIN_SRC emacs-lisp :tangle yes
;; make electric-pair-mode work on more brackets
(setq electric-pair-pairs
      '(
        (?\" . ?\")
        (?\{ . ?\})
        (?\[ . ?\])
        (?\` . ?\')))
#+END_SRC

#+RESULTS:
: ((34 . 34) (123 . 125) (91 . 93) (96 . 39))

** Electric Pair for Org-Mode
And now on to Org mode: 

From: https://ipfs-sec.stackexchange.cloudflare-ipfs.com/emacs/A/question/2538.html 
and https://tgro.neocities.org/init.html

I dunno why some pairs work (//, ==)and some don't (~, *, _)...

#+begin_src emacs-lisp :tangle yes :results silent 
(defvar org-electric-pairs '(
                             ;; (?/ . ?/) 
                             (?= . ?=) 
                             (?~ . ?~)
                             (?$ . ?$)
                             (?[ . ?])
                             (?\" . ?\")
                             (?\` . ?\')
                             ) 
  "Electric pairs for Org-mode.")

(defun org-add-electric-pairs ()
  (setq-local electric-pair-pairs (append electric-pair-pairs org-electric-pairs))
  (setq-local electric-pair-text-pairs electric-pair-pairs))

(add-hook 'org-mode-hook 'org-add-electric-pairs)
#+end_src

These pairs 

#+BEGIN_EXAMPLE
                             ;; (?* . ?*) 
                             ;; (?_ . ?_) 
#+END_EXAMPLE

not included as they were obstrusive.

** Electric Pair for LaTeX

https://tex.stackexchange.com/questions/75697/auctex-how-to-cause-math-mode-dollars-to-be-closed-automatically-with-electric

DGM, 22 jan 20. Trying to get the =[]= pair in latex

#+begin_src emacs-lisp :tangle yes
(add-hook 'LaTeX-mode-hook
          '(lambda ()
            (define-key LaTeX-mode-map (kbd "$") 'self-insert-command)
            (define-key LaTeX-mode-map (kbd "[") 'self-insert-command)))
#+end_src

#+RESULTS:
| (lambda nil (local-set-key (kbd $) 'brf-TeX-dollarm)) | (lambda nil (highlight-symbol-mode)) | (lambda nil (paredit-mode) (auto-complete-mode) (visual-line-mode) (advice-add 'paredit-backward-delete :around #'paredit-backward-delete-advice) (advice-add 'paredit-forward-delete :around #'paredit-forward-delete-advice) (advice-add 'paredit-doublequote :override #'paredit-nonsmart-doublequote)) | (lambda nil (define-key LaTeX-mode-map (kbd $) 'self-insert-command) (define-key LaTeX-mode-map (kbd [) 'self-insert-command)) | TeX-PDF-mode | turn-on-reftex | latex-unicode-simplified |

But it is not working. I try this:

#+begin_src emacs-lisp :tangle no
(defun brf-TeX-Inserting (sta stb stc num)
  " after entering stb insert stc and go back with the cursor by num positions.
    With prefix nothings gets replaced. If the previous char was sta nothing will be 
    replaces as well." 
  (if (null current-prefix-arg)
      (progn
        (if (= (preceding-char) sta )
            (insert stb)
          (progn (insert stc) (backward-char num))))
    (insert stb)))

(defun brf-TeX-dollarm () (interactive) (brf-TeX-Inserting ?\\ "$"  "$$" 1))

(add-hook 'LaTeX-mode-hook
   (function (lambda ()
       (local-set-key (kbd "$")      'brf-TeX-dollarm))))
#+end_src

#+RESULTS:
| (lambda nil (local-set-key (kbd $) 'brf-TeX-dollarm)) | (lambda nil (highlight-symbol-mode)) | (lambda nil (paredit-mode) (auto-complete-mode) (visual-line-mode) (advice-add 'paredit-backward-delete :around #'paredit-backward-delete-advice) (advice-add 'paredit-forward-delete :around #'paredit-forward-delete-advice) (advice-add 'paredit-doublequote :override #'paredit-nonsmart-doublequote)) | (lambda nil (define-key LaTeX-mode-map (kbd $) 'self-insert-command) (define-key LaTeX-mode-map (kbd [) 'self-insert-command)) | TeX-PDF-mode | turn-on-reftex | latex-unicode-simplified |

