starter-kit-parens.el

(provide 'starter-kit-parens)

(message "Starter Kit Parens File loaded.")
